In [150]:
import pandas as pd
import numpy as np

In [151]:
from pydataset import data

In [7]:
data('BOD', show_doc=True)
#df = data(BOD)

BOD

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

##  Biochemical Oxygen Demand

### Description

The `BOD` data frame has 6 rows and 2 columns giving the biochemical oxygen
demand versus time in an evaluation of water quality.

### Usage

    BOD

### Format

This data frame contains the following columns:

Time

A numeric vector giving the time of the measurement (days).

demand

A numeric vector giving the biochemical oxygen demand (mg/l).

### Source

Bates, D.M. and Watts, D.G. (1988), _Nonlinear Regression Analysis and Its
Applications_, Wiley, Appendix A1.4.

Originally from Marske (1967), _Biochemical Oxygen Demand Data Interpretation
Using Sum of Squares Surface_ M.Sc. Thesis, University of Wisconsin – Madison.

### Examples

    require(stats)
    # simplest form of fitting a first-order model to these data
    fm1 <- nls(demand ~ A*(1-exp(-exp(lrc)*Time)), data = BOD,
       start = c(A = 20, lrc = log(.35)))
    coef(fm1)
    fm1
    # using the plinear algorithm
    fm2 <- nls(demand ~ (1-exp(-exp(lrc)*Time)), data = BOD,
       start = c(lrc = log(.35)), algorithm = "plinear", trace = TRUE)
    # using a self-starting model
    fm3 <- nls(demand ~ SSasympOrig(Time, A, lrc), data = BOD)
    summary(fm3)

In [4]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [ ]:
#from env import host, user, password

#url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [152]:
def get_db_url(db_name):
    from env import host, user, password
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'

In [19]:
sql = """
    SELECT * FROM employees
    """

In [20]:
# Connection String has all the info to connect

url = get_db_url("employees")

df  = pd.read_sql(sql, url)
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

# Exercises Part 1

In [ ]:
#Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
#cd into your exercises folder for this module and run echo env.py >> .gitignore
#Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

#Use your function to obtain a connection to the employees database.

#Once you have successfully run a query:

#a. Intentionally make a typo in the database url. What kind of error message do you see?

#b. Intentionally make an error in your SQL query. What does the error message look like?

#Read the employees and titles tables into two separate DataFrames.

#How many rows and columns do you have in each DataFrame? Is that what you expected?

#Display the summary statistics for each DataFrame.

#How many unique titles are in the titles DataFrame?

#What is the oldest date in the to_date column?

#What is the most recent date in the to_date column?

In [ ]:
#Read the employees and titles tables into two separate DataFrames.

In [21]:
# Employees Data Frame

sql = """
    SELECT * FROM employees
    """

url = get_db_url("employees")

Employees_DF  = pd.read_sql(sql, url)
Employees_DF.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [22]:
# Titles Data Frame

sql = """
    SELECT * FROM titles
    """

url = get_db_url("employees")

Titles_DF  = pd.read_sql(sql, url)
Titles_DF.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [24]:
#How many rows and columns do you have in each DataFrame? Is that what you expected?

Employees_DF.shape

(300024, 6)

In [25]:
Titles_DF.shape

(443308, 4)

In [ ]:
#Display the summary statistics for each DataFrame.

In [27]:
Employees_DF.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [28]:
Titles_DF.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [ ]:
#How many unique titles are in the titles DataFrame?

In [44]:
sql = """
    SELECT COUNT(DISTINCT title) AS "Unique Titles" FROM titles
    """

url = get_db_url("employees")

Titles_DF  = pd.read_sql(sql, url)
Titles_DF

   Unique Titles
0              7

In [49]:
url = get_db_url("employees")

Titles_DF = pd.read_sql("SELECT COUNT(DISTINCT title) FROM titles",url)
Titles_DF

   COUNT(DISTINCT title)
0                      7

In [43]:
sql = """
    SELECT DISTINCT title FROM titles
    """

url = get_db_url("employees")

Titles_DF  = pd.read_sql(sql, url)
len(Titles_DF)
Titles_DF.

7

In [36]:
#What is the oldest date in the to_date column?

In [51]:
sql = """
    SELECT to_date 
    FROM titles 
    ORDER BY to_date ASC
    """

url = get_db_url("employees")

Titles_DF  = pd.read_sql(sql, url)
#Titles_DF.head(1)
Titles_DF.min()

to_date    1985-03-01
dtype: object

In [39]:
#What is the most recent date in the to_date column?

In [95]:
sql = """
    SELECT to_date 
    FROM titles 
    WHERE to_date NOT LIKE '9999%%'
    """ 

url = get_db_url("employees")

Titles_DF  = pd.read_sql(sql, url)
Titles_DF.max()

to_date    2002-08-01
dtype: object

# Exercises Part 2

In [ ]:
# .)Copy the users and roles DataFrames from the examples above.

In [5]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [6]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [ ]:
# .)What is the result of using a right join on the DataFrames?

In [54]:
users.merge(roles, how = 'right')

   id       name  role_id
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN

In [55]:
roles.merge(users, how = 'right')

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [56]:
# .)What is the result of using an outer join on the DataFrames?

In [57]:
roles.merge(users, how = 'outer')

   id       name  role_id
0   1      admin      NaN
1   2     author      NaN
2   3   reviewer      NaN
3   4  commenter      NaN
4   1        bob      1.0
5   2        joe      2.0
6   3      sally      3.0
7   4       adam      3.0
8   5       jane      NaN
9   6       mike      NaN

In [58]:
users.merge(roles, how = 'outer')

   id       name  role_id
0   1        bob      1.0
1   2        joe      2.0
2   3      sally      3.0
3   4       adam      3.0
4   5       jane      NaN
5   6       mike      NaN
6   1      admin      NaN
7   2     author      NaN
8   3   reviewer      NaN
9   4  commenter      NaN

In [59]:
# .)What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [7]:
users.merge(roles).drop(columns = 'role_id')

Empty DataFrame
Columns: [id, name]
Index: []

In [8]:
# .)Load the mpg dataset from PyDataset.

In [10]:
mpg = data('mpg')

In [11]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [12]:
# .)Output and read the documentation for the mpg dataset.

In [18]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [19]:
# .)How many rows and columns are in the dataset?

In [20]:
mpg.shape

(234, 11)

In [21]:
# .)Check out your column names and perform any cleanup you may want on them.

In [22]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [24]:
mpg = mpg.rename(columns={'cty': 'city', 'hwy': 'highway', 'cyl': 'cylinder'})

In [25]:
mpg

,manufacturer,model,displ,year,cylinder,trans,drv,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [26]:
# .)Display the summary statistics for the dataset.

In [27]:
mpg.describe()

            displ         year    cylinder        city     highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [28]:
# .)How many different manufacturers are there?

In [40]:
len(mpg.groupby(["manufacturer"]).agg(["count"]))

15

In [41]:
# .)How many different models are there?

In [43]:
len(mpg.groupby(["model"]))

38

In [44]:
# .)Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the 
# difference between highway and city mileage for each car.

In [45]:
mpg['mileage_difference'] = (mpg['highway'] - mpg['city'])

In [46]:
mpg

,manufacturer,model,displ,year,cylinder,trans,drv,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

In [47]:
# .)Create a column named average_mileage like you did in the DataFrames exercises; 
#this is the mean of the city and highway mileage.

In [57]:
mpg['average_mileage'] = (mpg['city'] + mpg['highway'])/2

In [58]:
mpg

,manufacturer,model,displ,year,cylinder,trans,drv,city,highway,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [59]:
# .)Create a new column on the mpg dataset named 
# is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [131]:
mpg['is_automatic'] = np.where(mpg.trans != ('manual(m5)' or 'manual(m6)'), True, False)

In [73]:
mpg

,manufacturer,model,displ,year,cylinder,trans,drv,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,True
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,True
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

In [66]:
len(mpg.groupby(["trans"]))

10

In [68]:
mpg.groupby(["trans"]).count()

,manufacturer,model,displ,year,cylinder,drv,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
trans,,,,,,,,,,,,,
auto(av),5,5,5,5,5,5,5,5,5,5,5,5,5
auto(l3),2,2,2,2,2,2,2,2,2,2,2,2,2
auto(l4),83,83,83,83,83,83,83,83,83,83,83,83,83
auto(l5),39,39,39,39,39,39,39,39,39,39,39,39,39
auto(l6),6,6,6,6,6,6,6,6,6,6,6,6,6
auto(s4),3,3,3,3,3,3,3,3,3,3,3,3,3
auto(s5),3,3,3,3,3,3,3,3,3,3,3,3,3
auto(s6),16,16,16,16,16,16,16,16,16,16,16,16,16
manual(m5),58,58,58,58,58,58,58,58,58,58,58,58,58
manual(m6),19,19,19,19,19,19,19,19,19,19,19,19,19

In [74]:
# .)Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [79]:
mpg.groupby(['manufacturer']).agg(['mean', 'max']).T

manufacturer                    audi    chevrolet        dodge      ford  \
displ              mean     2.544444     5.063158     4.378378     4.536
                   max      4.200000     7.000000     5.900000     5.400
year               mean  2003.500000  2004.684211  2004.108108  2002.600
                   max   2008.000000  2008.000000  2008.000000  2008.000
cylinder           mean     5.222222     7.263158     7.081081     7.200
                   max      8.000000     8.000000     8.000000     8.000
city               mean    17.611111    15.000000    13.135135    14.000
                   max     21.000000    22.000000    18.000000    18.000
highway            mean    26.444444    21.894737    17.945946    19.360
                   max     31.000000    30.000000    24.000000    26.000
mileage_difference mean     8.833333     6.894737     4.810811     5.360
                   max     11.000000    11.000000     7.000000     9.000
average_mileage    mean    22.027778    18.447368    15.540541    16.680
                   max     25.500000    26.000000    21.000000    22.000

manufacturer                   honda      hyundai       jeep  land rover  \
displ              mean     1.711111     2.428571     4.5750         4.3
                   max      2.000000     3.300000     6.1000         4.6
year               mean  2003.000000  2004.142857  2005.7500      2003.5
                   max   2008.000000  2008.000000  2008.0000      2008.0
cylinder           mean     4.000000     4.857143     7.2500         8.0
                   max      4.000000     6.000000     8.0000         8.0
city               mean    24.444444    18.642857    13.5000        11.5
                   max     28.000000    21.000000    17.0000        12.0
highway            mean    32.555556    26.857143    17.6250        16.5
                   max     36.000000    31.000000    22.0000        18.0
mileage_difference mean     8.111111     8.214286     4.1250         5.0
                   max     12.000000    10.000000     5.0000         6.0
average_mileage    mean    28.500000    22.750000    15.5625        14.0
                   max     30.500000    26.000000    19.5000        15.0

manufacturer                 lincoln   mercury       nissan  pontiac  \
displ              mean     5.400000     4.400     3.269231     3.96
                   max      5.400000     5.000     5.600000     5.30
year               mean  2002.000000  2003.500  2003.846154  2002.60
                   max   2008.000000  2008.000  2008.000000  2008.00
cylinder           mean     8.000000     7.000     5.538462     6.40
                   max      8.000000     8.000     8.000000     8.00
city               mean    11.333333    13.250    18.076923    17.00
                   max     12.000000    14.000    23.000000    18.00
highway            mean    17.000000    18.000    24.615385    26.40
                   max     18.000000    19.000    32.000000    28.00
mileage_difference mean     5.666667     4.750     6.538462     9.40
                   max      6.000000     6.000     9.000000    10.00
average_mileage    mean    14.166667    15.625    21.346154    21.70
                   max     15.000000    16.000    27.500000    23.00

manufacturer                  subaru       toyota   volkswagen
displ              mean     2.457143     2.952941     2.255556
                   max      2.500000     5.700000     3.600000
year               mean  2004.142857  2002.705882  2002.666667
                   max   2008.000000  2008.000000  2008.000000
cylinder           mean     4.000000     5.117647     4.592593
                   max      4.000000     8.000000     6.000000
city               mean    19.285714    18.529412    20.925926
                   max     21.000000    28.000000    35.000000
highway            mean    25.571429    24.911765    29.222222
                   max     27.000000    37.000000    44.000000
mileage_difference mean     6.285714     6.382353     8.296296
                   max      7.000000    10.000000    12.000000
average_mileage    mean    22.428571    21.720588    25.074074
                   max     23.500000    32.500000    39.500000

In [80]:
mpg.groupby(['manufacturer']).average_mileage.agg(['max'])

               max
manufacturer
audi          25.5
chevrolet     26.0
dodge         21.0
ford          22.0
honda         30.5
hyundai       26.0
jeep          19.5
land rover    15.0
lincoln       15.0
mercury       16.0
nissan        27.5
pontiac       23.0
subaru        23.5
toyota        32.5
volkswagen    39.5

In [82]:
mpg.groupby('average_mileage').manufacturer.describe().tail(1)

                count unique         top freq
average_mileage
39.5                1      1  volkswagen    1

In [83]:
# .)Do automatic or manual cars have better miles per gallon?

In [130]:
mpg['is_manual'] = np.where(mpg.trans == ('manual(m5)' or 'manual(m6)'), True, False)

In [89]:
#average_mileage of automatic > average_mileage of manual

In [148]:
mpg.groupby(['is_automatic']).agg(['mean'])

,displ,year,cylinder,city,highway,mileage_difference,average_mileage,is_manual
,mean,mean,mean,mean,mean,mean,mean,mean
is_automatic,,,,,,,,
False,2.732759,2001.482759,5.000000,19.258621,26.293103,7.034483,22.775862,True
True,3.715341,2004.164773,6.181818,16.068182,22.500000,6.431818,19.284091,False

In [138]:
mpg.average_mileage.median()

20.5

In [144]:
Average_Mile_Auto = mpg[mpg.is_automatic].average_mileage.median()

In [145]:
Average_Mile_Manual = mpg[mpg.is_manual].average_mileage.median()

In [147]:
AutoVSManu = Average_Mile_Auto < Average_Mile_Manual
AutoVSManu

True

In [116]:
mpg

,manufacturer,model,displ,year,cylinder,trans,drv,city,highway,fl,class,mileage_difference,average_mileage,is_automatic,is_manual
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True,False
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False,True
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,True,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True,False
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True,False
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,True,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True,False
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False,True
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True,False

# Exercises Part 3

In [ ]:
# Use your get_db_url function to help you explore the data from the chipotle database.

In [181]:
url = get_db_url('chipotle')

In [182]:
sql = """
    SELECT * FROM orders
    """

Chipotle_DF = pd.read_sql(sql, url)
Chipotle_DF

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

In [ ]:
# What is the total price for each order?

In [183]:
Chipotle_DF['price'] = Chipotle_DF['item_price'].str.replace('$','')

<ipython-input-183-3366e291cc2d>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  Chipotle_DF['price'] = Chipotle_DF['item_price'].str.replace('$','')

In [184]:
Chipotle_DF['price'] = Chipotle_DF['price'].astype(float)

In [191]:
Chipotle_DF.groupby(['order_id']).price.agg('sum')

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: price, Length: 1834, dtype: float64

In [192]:
Chipotle_DF.groupby(['order_id']).agg('sum')

             id  quantity  price
order_id
1            10         4  11.56
2             5         2  16.98
3            13         2  12.67
4            17         2  21.00
5            21         2  13.70
...         ...       ...    ...
1830       9223         2  23.00
1831      13842         3  12.90
1832       9233         2  13.20
1833       9237         2  23.50
1834      13863         3  28.75

[1834 rows x 3 columns]

In [185]:
Chipotle_DF

,id,order_id,quantity,item_name,choice_description,item_price,price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,2.39
1,2,1,1,Izze,[Clementine],$3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98,16.98
...,...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75,11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75,11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25,11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75,8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75,8.75

In [193]:
# What are the most popular 3 items?

In [232]:
#pd.crosstab(Chipotle_DF.item_name, Chipotle_DF.quantity, margins = True).T.max()

#pd.crosstab(Chipotle_DF.item_name, Chipotle_DF.quantity)
#Chipotle_DF.groupby(['item_name']).quantity.agg('sum')

Chipotle_DF.pivot_table(index='item_name', columns='order_id', values='price', aggfunc=('sum')).head(3)

order_id,1,2,3,4,5,6,7,8,9,10,...,1825,1826,1827,1828,1829,1830,1831,1832,1833,1834
item_name,,,,,,,,,,,,,,,,,,,,,
6 Pack Soft Drink,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Barbacoa Bowl,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,11.75,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Barbacoa Burrito,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,11.75,NaN,18.5,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [225]:
Top_Orders = Chipotle_DF.groupby(['item_name']).quantity.agg('sum')
Top_Orders.nlargest(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

In [204]:
# Which item has produced the most revenue?

In [208]:
Item_money = Chipotle_DF.groupby(['item_name']).price.agg('sum')
Item_money.nlargest(1)

item_name
Chicken Bowl    7342.73
Name: price, dtype: float64

In [209]:
# Join the employees and titles DataFrames together.

In [210]:
url = get_db_url('employees')

sql = """
    SELECT * FROM employees
    """

Employees_DF = pd.read_sql(sql, url)
Employees_DF

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [212]:
url = get_db_url('employees')

sql = """
    SELECT * FROM titles
    """

Titles_DF = pd.read_sql(sql, url)
Titles_DF

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [216]:
Employee_Title_DF =Employees_DF.merge(Titles_DF)
Employee_Title_DF

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

In [235]:
# For each title, find the hire date of the employee that was hired most recently with that title.

Employee_Title_DF.groupby('title').hire_date.agg('max')

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

In [220]:
#Employee_Title_DF
pd.crosstab(Employee_Title_DF.hire_date, Employee_Title_DF.title, margins = True).T

hire_date,1985-01-01,1985-01-14,1985-02-01,1985-02-02,1985-02-03,1985-02-04,1985-02-05,1985-02-06,1985-02-07,1985-02-08,...,2000-01-04,2000-01-06,2000-01-08,2000-01-11,2000-01-12,2000-01-13,2000-01-22,2000-01-23,2000-01-28,All
title,,,,,,,,,,,,,,,,,,,,,
Assistant Engineer,0,0,1,7,5,2,7,7,5,7,...,0,0,0,0,0,0,0,0,0,15128
Engineer,0,0,8,39,47,59,38,31,46,53,...,0,0,0,1,0,0,1,1,1,115003
Manager,9,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,24
Senior Engineer,0,0,8,40,49,50,43,38,40,49,...,0,0,0,0,0,0,0,0,0,97750
Senior Staff,2,1,4,42,38,23,39,37,40,40,...,0,1,1,0,0,1,0,0,0,92853
Staff,4,0,4,39,31,29,37,35,37,41,...,1,0,0,0,1,0,0,0,0,107391
Technique Leader,3,0,1,6,6,5,4,5,9,5,...,0,0,0,0,0,0,0,0,0,15159
All,18,2,26,173,176,168,168,153,177,195,...,1,1,1,1,1,1,1,1,1,443308

In [ ]:
Employee_Title_DF.groupby('title').

In [221]:

# Write the code necessary to create a cross tabulation of the number of titles by department. 
# (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas 
# code to perform the manipulations.)

In [222]:
url = get_db_url('employees')

sql = """
    SELECT * FROM titles
    JOIN dept_emp using(emp_no)
    JOIN departments using(dept_no)
    """

Dept_title_DF = pd.read_sql(sql, url)
Dept_title_DF

,dept_no,emp_no,title,from_date,to_date,from_date,to_date,dept_name
0,d009,10011,Staff,1990-01-22,1996-11-09,1990-01-22,1996-11-09,Customer Service
1,d009,10038,Senior Staff,1996-09-20,9999-01-01,1989-09-20,9999-01-01,Customer Service
2,d009,10038,Staff,1989-09-20,1996-09-20,1989-09-20,9999-01-01,Customer Service
3,d009,10049,Senior Staff,2000-05-04,9999-01-01,1992-05-04,9999-01-01,Customer Service
4,d009,10049,Staff,1992-05-04,2000-05-04,1992-05-04,9999-01-01,Customer Service
...,...,...,...,...,...,...,...,...
489898,d007,499986,Senior Staff,1992-08-11,9999-01-01,1985-08-11,9999-01-01,Sales
489899,d007,499986,Staff,1985-08-11,1992-08-11,1985-08-11,9999-01-01,Sales
489900,d007,499987,Staff,1999-12-21,9999-01-01,1999-12-21,9999-01-01,Sales
489901,d007,499988,Senior Staff,1997-07-25,2001-10-09,1988-07-25,2001-10-09,Sales
489902,d007,499988,Staff,1988-07-25,1997-07-25,1988-07-25,2001-10-09,Sales

In [233]:
pd.crosstab(Dept_title_DF.dept_name, Dept_title_DF.title, margins = True)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader,All
dept_name,,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309,35075
Development,7769,58135,2,49326,1247,1424,7683,125586
Finance,0,0,2,0,12139,13929,0,26070
Human Resources,0,0,2,0,12274,14342,0,26618
Marketing,0,0,2,0,13940,16196,0,30138
Production,6445,49649,4,42205,1270,1478,6557,107608
Quality Management,1831,13852,4,11864,0,0,1795,29346
Research,378,2986,2,2570,11637,13495,393,31461
Sales,0,0,2,0,36191,41808,0,78001
All,16721,126984,24,107992,102623,118822,16737,489903